app/views/users/_sites.html.erb

SELECT "sites".* FROM "sites"  WHERE "sites"."user_id" = ?  [["user_id", 1]]
---
<div class="row">
<%@user.sites.each do |site|%>