app/controllers/products_controller.rb

SELECT  1 AS one FROM "products"  WHERE "products"."alias" = 'product1' AND "products"."site_id" = 1 LIMIT 1
INSERT INTO "products" ("alias", "created_at", "description", "price", "site_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    authorize
    authorize_site
    @product=Product.new(product_params)
    if Product.exists?(:alias => product_params[:alias],:site_id=>@site[:id])
      flash[:notice] = "Product already exists, try adding new one"
      render action: 'new'
    else
      @product[:user_id]=@user[:id]
      @product[:site_id]=@site[:id]
      if @product.save