app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites"
---
  def index
    flash[:notice] = ""
    reset_session
    session.clear
    @sites=Site.all

SELECT  1 AS one FROM "sites"  WHERE "sites"."alias" = 'testsite' AND "sites"."user_id" = 1 LIMIT 1
INSERT INTO "sites" ("alias", "created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["alias", "testsite"], ["created_at", "2014-11-06 04:20:17.084482"], ["description", "this is test site"], ["title", "test site"], ["updated_at", "2014-11-06 04:20:17.084482"], ["user_id", 1]]
---
  def create
    authorize
    if Site.exists?(:alias => site_params[:alias],:user_id => session[:id])
      @site=Site.new
      flash[:notice] = "Error! Site already exists, please try different"
      render action: 'new'
    else
      @site = Site.new(site_params)
      getUser
      @site.user=@user
      if @site.save