app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'test@test.com' LIMIT 1
SELECT  1 AS one FROM "users"  WHERE "users"."email" = 'test@test.com' AND "users"."password" = 'test' LIMIT 1
---
  def login
    if User.exists?(:email => user_params[:email],:password =>user_params[:password])

SELECT  1 AS one FROM "users"  WHERE "users"."email" = 'test@test.com' LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-06 01:23:12.345916"], ["email", "test@test.com"], ["name", "test"], ["password", "test"], ["updated_at", "2014-11-06 01:23:12.345916"]]
---
  def create
    if User.exists?(:email => user_params[:email])
        @user = User.new(user_params)
        flash[:notice] = "Error! User already exists, please try different"
        render action: 'new'
    else
      @user = User.new(user_params)
      if @user.save