app/controllers/welcome_controller.rb

SELECT "sites".* FROM "sites"
---
  def index
    flash[:notice] = ""
    reset_session
    session.clear
    @sites=Site.all