app/views/sites/_products.html.erb

<div class="row">
<%@site.products.each do |product|%>
---
SELECT "products".* FROM "products"  WHERE "products"."site_id" = ?  [["site_id", 10]]